CSI API ETABS v1
cSapModel.GetModelIsLocked Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
bool GetModelIsLocked()
Function GetModelIsLocked As Boolean
Dim instance As cSapModel
Dim returnValue As Boolean
returnValue = instance.GetModelIsLocked()
bool GetModelIsLocked()
abstract GetModelIsLocked : unit -> bool
Return Value
Type: Boolean
See Also
Reference
cSapModel Interface
ETABSv1 Namespace